#ifndef COMMANDS_UPDATE_H_
#define COMMANDS_UPDATE_H_

//----------------------------------------------------------------------------------------------------//

#include "General_Params.h"

//----------------------------------------------------------------------------------------------------//

typedef struct
{
	
	uint16_t Counter_of_Pressed;			// Счетчик количества нажатий кнопки
	uint8_t  GCD_Value;								// Значение наибольшего общего делителя числа
	
	bool 		 bButtons_Was_Blocked;		// Флаг, сигнализирующий о блокировке устройства
	bool 		 bBlink_Mode;							// Флаг режима мигания светодиодом
	
} T_Service;

//----------------------------------------------------------------------------------------------------//

void Commands_Handling(uint16_t Command);

//----------------------------------------------------------------------------------------------------//

#endif // COMMANDS_UPDATE_H_

//----------------------------------------- END OF FILE ----------------------------------------------//
